# pandas - pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

https://pandas.pydata.org/

* Series


* DataFrames


* Missing Data handling


* GroupBy


* Operations


* Data input and output

### Series

First main data type in pandas is Series. Its very similar to numpy arrays.

Differences b/w numpy array and pandas series:

1) Series can store any data type


2) In ndarrays we select the values by their indices which is numeric, in series index can be numeric or character

In [1]:
import numpy as np

import pandas as pd

### Create a series

You can convert a list, np array or a dictionary into a series

In [3]:
labels = ['a','b','c'] # list of strings
my_list = [10,20,30] # list of numbers
arr = np.array([10,20,30]) # numpy array 
mydict = {'a':10,'b':'20','c':30} # dictionary

In [4]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

### creating series from numpy arrays

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int64

### creating series from dictionary

In [10]:
pd.Series(mydict)

a    10
b    20
c    30
dtype: object

In [11]:
pd.Series([sum,len,print,type])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
3               <class 'type'>
dtype: object

#### Use of index

In [13]:
ser1 = pd.Series([1,2,3,4,5],index=['AP','Haryana','Mumbai','Chennai','Bidhannagar'])

In [14]:
ser1

AP             1
Haryana        2
Mumbai         3
Chennai        4
Bidhannagar    5
dtype: int64

In [15]:
ser1['Mumbai']

3

In [16]:
ser2 = pd.Series([10,20,30,40,50],index=['AP','Haryana','Mumbai','Chennai','Vadodara'])

In [17]:
ser1 + ser2

AP             11.0
Bidhannagar     NaN
Chennai        44.0
Haryana        22.0
Mumbai         33.0
Vadodara        NaN
dtype: float64

## DataFrames

Dataframes are workhorse of pandas and are directly inspired by R language.

In [21]:
df = pd.DataFrame(np.random.randn(5,4),
                  index='A B C D E'.split(), # ['A','B',...,'E']
                  columns='W X Y Z'.split())

In [24]:
df

          W         X         Y         Z
A -0.265335 -0.602778  0.096441 -1.590897
B  0.337500  1.377430  0.926354  1.573050
C -0.877193  1.869511 -0.707760  1.404156
D -0.437207 -0.969254 -0.153828 -1.357451
E -1.088265 -1.216913  1.764050 -0.214975

#### Selection and indexing

In [23]:
df['W']

A   -0.265335
B    0.337500
C   -0.877193
D   -0.437207
E   -1.088265
Name: W, dtype: float64

In [25]:
df[['W','Z']]

          W         Z
A -0.265335 -1.590897
B  0.337500  1.573050
C -0.877193  1.404156
D -0.437207 -1.357451
E -1.088265 -0.214975

In [27]:
df['W'] # Pandas Syntax ---- RECOMMENDED

A   -0.265335
B    0.337500
C   -0.877193
D   -0.437207
E   -1.088265
Name: W, dtype: float64

In [29]:
df.W # SQL Syntax ---- NOT Recommended

A   -0.265335
B    0.337500
C   -0.877193
D   -0.437207
E   -1.088265
Name: W, dtype: float64

#### Adding Columns

In [37]:
df['new'] = df['W'] + df['Z']

In [31]:
df

          W         X         Y         Z       new
A -0.265335 -0.602778  0.096441 -1.590897 -1.856232
B  0.337500  1.377430  0.926354  1.573050  1.910550
C -0.877193  1.869511 -0.707760  1.404156  0.526963
D -0.437207 -0.969254 -0.153828 -1.357451 -1.794658
E -1.088265 -1.216913  1.764050 -0.214975 -1.303240

#### Deleting columns

In [33]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.265335 -0.602778  0.096441 -1.590897
B  0.337500  1.377430  0.926354  1.573050
C -0.877193  1.869511 -0.707760  1.404156
D -0.437207 -0.969254 -0.153828 -1.357451
E -1.088265 -1.216913  1.764050 -0.214975

In [34]:
df

          W         X         Y         Z       new
A -0.265335 -0.602778  0.096441 -1.590897 -1.856232
B  0.337500  1.377430  0.926354  1.573050  1.910550
C -0.877193  1.869511 -0.707760  1.404156  0.526963
D -0.437207 -0.969254 -0.153828 -1.357451 -1.794658
E -1.088265 -1.216913  1.764050 -0.214975 -1.303240

In [35]:
df = df.drop('new',axis=1)

In [36]:
df

          W         X         Y         Z
A -0.265335 -0.602778  0.096441 -1.590897
B  0.337500  1.377430  0.926354  1.573050
C -0.877193  1.869511 -0.707760  1.404156
D -0.437207 -0.969254 -0.153828 -1.357451
E -1.088265 -1.216913  1.764050 -0.214975

In [38]:
df.drop('new',axis=1,inplace=True) # Preferred

In [39]:
df

          W         X         Y         Z
A -0.265335 -0.602778  0.096441 -1.590897
B  0.337500  1.377430  0.926354  1.573050
C -0.877193  1.869511 -0.707760  1.404156
D -0.437207 -0.969254 -0.153828 -1.357451
E -1.088265 -1.216913  1.764050 -0.214975

In [40]:
df.drop('E')

          W         X         Y         Z
A -0.265335 -0.602778  0.096441 -1.590897
B  0.337500  1.377430  0.926354  1.573050
C -0.877193  1.869511 -0.707760  1.404156
D -0.437207 -0.969254 -0.153828 -1.357451

#### Selecting Rows

In [45]:
df.loc['A'] # By Index

W   -0.265335
X   -0.602778
Y    0.096441
Z   -1.590897
Name: A, dtype: float64

In [44]:
df.iloc[0] # by position

W   -0.265335
X   -0.602778
Y    0.096441
Z   -1.590897
Name: A, dtype: float64

#### Selecting subset by rows and columns

In [48]:
df.loc['B','Y']

0.9263544800011009

In [49]:
df.loc[['B','C'],['W','Z']]

          W         Z
B  0.337500  1.573050
C -0.877193  1.404156

#### Conditional Selection

In [50]:
df>0

       W      X      Y      Z
A  False  False   True  False
B   True   True   True   True
C  False   True  False   True
D  False  False  False  False
E  False  False   True  False

In [51]:
df[df>0]

        W         X         Y         Z
A     NaN       NaN  0.096441       NaN
B  0.3375  1.377430  0.926354  1.573050
C     NaN  1.869511       NaN  1.404156
D     NaN       NaN       NaN       NaN
E     NaN       NaN  1.764050       NaN

In [52]:
df[df['W']>0]

        W        X         Y        Z
B  0.3375  1.37743  0.926354  1.57305

In [53]:
df[df['W']>0]['Y']

B    0.926354
Name: Y, dtype: float64

In [55]:
df[df['W']>0][['Y','X']]

          Y        X
B  0.926354  1.37743

In [59]:
df[(df['W']>0) & (df['Z']>1)]

        W        X         Y        Z
B  0.3375  1.37743  0.926354  1.57305

In [60]:
df

          W         X         Y         Z
A -0.265335 -0.602778  0.096441 -1.590897
B  0.337500  1.377430  0.926354  1.573050
C -0.877193  1.869511 -0.707760  1.404156
D -0.437207 -0.969254 -0.153828 -1.357451
E -1.088265 -1.216913  1.764050 -0.214975

In [61]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.265335 -0.602778  0.096441 -1.590897
1     B  0.337500  1.377430  0.926354  1.573050
2     C -0.877193  1.869511 -0.707760  1.404156
3     D -0.437207 -0.969254 -0.153828 -1.357451
4     E -1.088265 -1.216913  1.764050 -0.214975

In [62]:
newIndex = 'CA TX IR NY MI'.split()

In [63]:
df['states'] = newIndex

In [64]:
df

          W         X         Y         Z states
A -0.265335 -0.602778  0.096441 -1.590897     CA
B  0.337500  1.377430  0.926354  1.573050     TX
C -0.877193  1.869511 -0.707760  1.404156     IR
D -0.437207 -0.969254 -0.153828 -1.357451     NY
E -1.088265 -1.216913  1.764050 -0.214975     MI

In [65]:
df.set_index('states')

               W         X         Y         Z
states
CA     -0.265335 -0.602778  0.096441 -1.590897
TX      0.337500  1.377430  0.926354  1.573050
IR     -0.877193  1.869511 -0.707760  1.404156
NY     -0.437207 -0.969254 -0.153828 -1.357451
MI     -1.088265 -1.216913  1.764050 -0.214975

In [67]:
df

          W         X         Y         Z states
A -0.265335 -0.602778  0.096441 -1.590897     CA
B  0.337500  1.377430  0.926354  1.573050     TX
C -0.877193  1.869511 -0.707760  1.404156     IR
D -0.437207 -0.969254 -0.153828 -1.357451     NY
E -1.088265 -1.216913  1.764050 -0.214975     MI

In [68]:
df.set_index('states',inplace=True)

In [69]:
df

               W         X         Y         Z
states
CA     -0.265335 -0.602778  0.096441 -1.590897
TX      0.337500  1.377430  0.926354  1.573050
IR     -0.877193  1.869511 -0.707760  1.404156
NY     -0.437207 -0.969254 -0.153828 -1.357451
MI     -1.088265 -1.216913  1.764050 -0.214975

### Multi Index and Hierarchy

In [94]:
country = 'USA USA USA IN IN IN'.split()
states = 'CA TX NY HR TN AP'.split()

(USA,CA),(USA,TX),(USA,NY)

In [95]:
hier_index = list(zip(country,states))

hier_index

[('USA', 'CA'),
 ('USA', 'TX'),
 ('USA', 'NY'),
 ('IN', 'HR'),
 ('IN', 'TN'),
 ('IN', 'AP')]

In [96]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('USA', 'CA'),
            ('USA', 'TX'),
            ('USA', 'NY'),
            ( 'IN', 'HR'),
            ( 'IN', 'TN'),
            ( 'IN', 'AP')],
           )

In [97]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [98]:
df

               A         B
USA CA  0.437792 -0.468668
    TX -0.151289 -0.539598
    NY -0.288356  1.616564
IN  HR  0.669834  1.562127
    TN -2.378319 -0.059567
    AP  0.329647  1.708087

np.random.randint(2,6)

In [100]:
df.loc['USA']

           A         B
CA  0.437792 -0.468668
TX -0.151289 -0.539598
NY -0.288356  1.616564

In [101]:
df.loc['IN'].loc['HR']

A    0.669834
B    1.562127
Name: HR, dtype: float64

In [102]:
df.index.names = ['Country','State']

In [103]:
df

                      A         B
Country State
USA     CA     0.437792 -0.468668
        TX    -0.151289 -0.539598
        NY    -0.288356  1.616564
IN      HR     0.669834  1.562127
        TN    -2.378319 -0.059567
        AP     0.329647  1.708087

#### Dataframe transpose

In [108]:
d = {'a':[1,2,3],'b':[4,5,6]}
df = pd.DataFrame(d)
df

   a  b
0  1  4
1  2  5
2  3  6

In [109]:
df.T

   0  1  2
a  1  2  3
b  4  5  6

#### Missing Data

In [110]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                   'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### Drop NaN

In [111]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [114]:
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [115]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

#### Impute

In [116]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

#### Groupby

In [118]:
d = {'Company':['GOOG','GOOG','GOOG','AMZN','AMZN','AMZN','FB','FB'],
     'Person':['Sam','Charlie','Vipul','Kiran','Hardik','Ajay','Pooja','Anoosha'],
     'Sales':[200,120,340,232,54,232,232,245]
    }

df = pd.DataFrame(d)

In [119]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    GOOG    Vipul    340
3    AMZN    Kiran    232
4    AMZN   Hardik     54
5    AMZN     Ajay    232
6      FB    Pooja    232
7      FB  Anoosha    245

In [122]:
by_comp = df.groupby('Company')

In [124]:
by_comp.sum()

         Sales
Company
AMZN       518
FB         477
GOOG       660

In [125]:
by_comp.describe()

        Sales
        count        mean         std    min     25%    50%     75%    max
Company
AMZN      3.0  172.666667  102.768348   54.0  143.00  232.0  232.00  232.0
FB        2.0  238.500000    9.192388  232.0  235.25  238.5  241.75  245.0
GOOG      3.0  220.000000  111.355287  120.0  160.00  200.0  270.00  340.0

In [126]:
by_comp

In [130]:
by_comp.describe().transpose()

Company            AMZN          FB        GOOG
Sales count    3.000000    2.000000    3.000000
      mean   172.666667  238.500000  220.000000
      std    102.768348    9.192388  111.355287
      min     54.000000  232.000000  120.000000
      25%    143.000000  235.250000  160.000000
      50%    232.000000  238.500000  200.000000
      75%    232.000000  241.750000  270.000000
      max    232.000000  245.000000  340.000000

In [131]:
by_comp.describe().transpose()['AMZN']

Sales  count      3.000000
       mean     172.666667
       std      102.768348
       min       54.000000
       25%      143.000000
       50%      232.000000
       75%      232.000000
       max      232.000000
Name: AMZN, dtype: float64

#### Operations

In [134]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[333,444,444,777],
    'col3':['abc','def','ghi','jkl']
})
df

   col1  col2 col3
0     1   333  abc
1     2   444  def
2     3   444  ghi
3     4   777  jkl

#### Info on unique values

In [135]:
df['col2'].unique()

array([333, 444, 777])

In [137]:
df['col2'].nunique()

3

#### Conditional Selection

In [138]:
new_df = df[(df['col1']>2) & (df['col2']>444)]

In [139]:
new_df

   col1  col2 col3
3     4   777  jkl

#### Apply functions

In [140]:
def times2(x):
    return x*2

In [141]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [143]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

#### Permanently removing columns

In [144]:
# df.drop('colname',axis=1)

del df['col1']

In [145]:
df

   col2 col3
0   333  abc
1   444  def
2   444  ghi
3   777  jkl

#### get index and col names

In [148]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [149]:
df

   col2 col3
0   333  abc
1   444  def
2   444  ghi
3   777  jkl

In [151]:
df.sort_values(by='col2',ascending=False)

   col2 col3
3   777  jkl
1   444  def
2   444  ghi
0   333  abc

In [153]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  x  3
3  bar  two  y  5
4  bar  one  x  6
5  bar  one  y  3

In [156]:
df.pivot_table(values='D',index=['A'],columns=['C'],aggfunc=np.sum)

C    x  y
A
bar  6  8
foo  4  2